myCodeFiles/app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("home_type", "room_type", "accommodate", "bed_room", "bath_room", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @room = current_user.rooms.build(room_params)
    if @room.save